Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་ཏུ་མཐོར་གཤེགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཤིན་མཐོར་གཤེགས་དེ་ཚེའི་ཚད་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ཐུབ་པར་གྱུར་ཏོ། ། དེའི་ཚེ་ན་མི་དེ་དག་གི་ཚེའི་ཚད་ཀྱང་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ཐུབ་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་ཏུ་མཐོར་གཤེགས་ཀྱི་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུའི་ཉན་ཐོས་དགྲ་བཅོམ་པ་ཤ་སྟག་འདུས་པ་བྱུང་སྟེ། ལོ་བྱེ་བ་རེ་རེ་ཞིང་ཉན་ཐོས་འདུས་པ་རེ་རེ་བྱུང་ངོ་། ། ཉན་ཐོས་འདུས་པ་རེ་རེ་ལ་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་བྱུང་སྟེ། དགྲ་བཅོམ་པ་འབའ་ཞིག་གོ །
en: “Then the time came when a tathāgata, arhat, fully accomplished buddha by the name of Atyuccagāmin appeared in that world, in that buddha realm. The extent of the lifespan of the Lord, the Tathāgata Atyuccagāmin, Śāriputra, was a full eight hundred forty million years, and the extent of the lifespan of the human beings there at that time was also a full eight hundred forty million years. Śāriputra, the tathāgata, arhat, fully accomplished Buddha Atyuccagāmin had a great assembly of śrāvakas consisting of eight hundred forty million śrāvakas who were arhats. For every ten million years that passed, there would be another assembly of śrāvakas. In each assembly of śrāvakas there would be eight hundred million śrāvakas who were all arhats.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་བུ་གཞོན་ནུ་དཔའ་བས་བྱིན་ཞེས་བྱ་བ་མང་དུ་ཐོས་པ་ཡིད་གཞུངས་པ་དེའི་རྒྱུས་དཔྱོད་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། ། ཤཱ་རིའི་བུ་གཞོན་ནུ་དེ་གཡོག་དང་བཅས་པ་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས་ བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་ཏུ་མཐོར་གཤེགས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོར་གཤེགས་དེ འི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ གཞོན་ནུ་དཔའ་བས་བྱིན་གཡོག་དང་བཅས་པ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ ། ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། དེ་ནས་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོར་གཤེགས་དེས་གཞོན་ནུ་དཔའ་བས་བྱིན་དེ འི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ སྔོན་བྱུང་བ་དང་ལྡན་པའི་གཏམ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །
en: “At that time there appeared a prince, a bodhisatva, by the name of Śūradatta, who was very learned and erudite and who had attained mastery of analytical abilities. Śāriputra, accompanied by a devoted retinue of eighty million, the prince went to where the Lord Atyuccagāmin, the tathāgata, the arhat, the fully accomplished Buddha, was staying, and when he arrived there he honored him by touching his head at the feet of the Lord, the Tathāgata Atyuccagāmin, and sat down to one side. When the prince Śūradatta and his retinue had sat down, Śāriputra, the Lord, the Tathāgata Atyuccagāmin, acknowledged the excellent intentions of the prince Śūradatta and then gave a talk about the connections between his present existence and his past existences.

source: དེ་ནས་ཤཱ་རིའི་བུ་རྒྱལ་བུ་གཞོན་ནུ་དཔའ་བས་བྱིན་དེ་ སྔོན་བྱུང་བ་དང་ལྡན་པའི་གཏམ་དེ་ཐོས་ནས་ དད་པ་རབ་ཏུ་ཐོབ་བོ། །དེ་སེམས་དད་པར་གྱུར་ནས་ སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། ། དེ་དེ་ན་ཚེ་ཇི་ཙམ་ཐུབ་པར་བྱང་ཆུབ་ཚོལ་ཞིང་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོར་གཤེགས་དེས་དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔའ་བས་བྱིན་འདི་ངའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བརྩོན་འགྲུས་ཆེན་པོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: “Śāriputra, listening to this talk about the connections between his present existence and his past existences, the prince Śūradatta developed trust. With a mind of faith, he, together with his retinue of eighty million beings, followed his conviction, left ordinary household life behind, and become a renunciant. From then on he lived the life of purity and devoted himself to the pursuit of awakening.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཆེན་པོའི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཕྱེད་ཐུབ་པར་གྱུར་ཏོ། ། དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དཔག་ཏུ་མེད་པ་ཞིག་བྱུང་སྟེ། དེའི་ཉན་ཐོས་འདུས་པ་རེ་རེ་ལ་ཡང་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཡོད་དེ་དགྲ་བཅོམ་པ་འབའ་ཞིག་གོ །
en: The lifespan of the tathāgata Mahāvīrya, Śāriputra, was half an eon. He had countless saṅghas of śrāvakas, and each assembly was made up of one billion two hundred million arhats, and no one who was not an arhat.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་མ་ཉམས་པ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མང་དུ་ཐོས་ཏེ བཟུང་། བཅངས། བཀླགས། ཀུན་ཆུབ་པར་བྱས་པས་མཐར་གྱིས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཆེན་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་བའི་བར་དུའོ། །
en: “That bodhisatva, Śāriputra, practiced the perfection of vigor with unrelenting vigor, studying the cycle of teachings contained in The Collected Teachings on the Bodhisatva in great detail, learning it, memorizing it, reading it, and absorbing it, until he eventually became the tathāgata named Mahāvīrya.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པའི་བརྩོན་འགྲུས་མ་ཉམས་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན་པར་བྱ། གཟུང་བར་བྱ་བ་ནས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུ་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་འགྲུས་མ་ཉམས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། ། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེ་ལ་བརྩོན་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: “This, Śāriputra, is why sons or daughters of good family who are established in the Mahāyāna and who wish to attain unsurpassed perfect awakening quickly should study the cycle of teachings contained in The Collected Teachings on the Bodhisatva in great detail, memorize it, and so forth, and teach it in great detail and do so with unyielding vigor. Why should they do this? This, Śāriputra, is the bodhisatvas’ perfection of vigor, and it is with this kind of unyielding vigor that they search for the cycle of teachings contained in The Collected Teachings on the Bodhisatva. This, Śāriputra, is the perfection of vigor of bodhisatvas, by means of which bodhisatvas practice the way of the bodhisatva.”

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ་དགུ་པའོ།། །།
en: This is the ninth chapter, “The Perfection of Vigor.”

source: བམ་པོ་བཅུ་དྲུག་པ།
en: Chapter 10:

source: དེ་ལ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་པ་རྣམས་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “What, then, is the bodhisatva’s perfection of meditation like, the perfection of meditation by means of which bodhisatvas, great beings, practice the way of the bodhisatva? Śāriputra, the bodhisatva has left desires behind. He has left evil, unwholesome qualities behind, and he attains and abides in the first meditative state, the state of joy and happiness that is born from seclusion and that includes conceptualization and deliberation.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྟོག་པ་དང་དཔྱོད་པ་ཉེ་བར་ཞི་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “Then, Śāriputra, the bodhisatva, having stilled conceptualization and deliberation, with a mind that has calmed itself and become focused, he attains and abides in the second meditative state, the state of joy and happiness that is born from concentration and that is without conceptualization and deliberation.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་བ། འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ། བདེ་བ་ལ་གནས་པ། བཏང་སྙོམས་པའོ། ། ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “Then, Śāriputra, the bodhisatva abides in equanimity because he is not attached to joy, and with mindfulness and thoughtfulness he experiences bliss in his body. This is what the noble ones refer to as the equanimity of mindfully dwelling in joy. This is the absence of joy, the third meditative state.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པའི་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “Then, Śāriputra, as the bodhisatva has eliminated happiness and has already eliminated suffering, positive and negative states of mind diminish, and he attains and abides in the fourth meditative state, the completely pure equanimity and mindfulness free from suffering and happiness.

source: དེ་དེ་ལྟར་སེམས་མཉམ་པར་བཞག་པ་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བར་གྱུར་ནས་ ཏིང་ངེ་འཛིན་ཀྱང་མི་གཏོང་ལ། བསམ་གཏན་གྱི་ལས་ཀྱང་བྱེད་དོ། །
en: “Such is the meditative state of mind that is completely pure, completely cleansed, unblemished, and free from the secondary vices. With this he does not lose his concentration but remains in his practice of meditation.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ལས་གང་ཞེ་ན། གང་མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། ། དེ་ལ་མངོན་པར་ཤེས་པ་གང་། ཡེ་ཤེས་གང་ཞེ་ན། མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། ལྷའི་མིག་དང་། ལྷའི་རྣ་བ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་དང་། རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱས་པ་མངོན་པར་ཤེས་པ་སྟེ། འདི་དག་ནི་མངོན་པར་ཤེས་པ་ལྔ་ཞེས་བྱའོ། །
en: “What, then, is the bodhisatva’s practice of meditation? It is the perfection of the practice of superior abilities and knowledge. What are his superior abilities? What is his knowledge? What we call superior abilities are the superior abilities of divine sight, divine hearing, knowledge of the thoughts of others, clear experiential recollection of previous states of existence, and the realization of magical methods. These are his five superior abilities.

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་མིག་གིས་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ནི་གང་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ནི་གང་ཞེ་ན།
en: “What then, Śāriputra, is the bodhisatva’s superior ability and knowledge of the realization of divine sight? What is the practice of the superior ability and knowledge that he fully perfects?

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སེམས་མཉམ་པར་བཞག་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བས་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་མངོན་སུམ་དུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སེམས་འཇུག་པར་བྱེད་དེ དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པས་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། བདེ་འགྲོ་དང་། ངན་འགྲོ་དང་། བཟང་པོ་དང་། ངན་པ་རྣམས་མཐོང་སྟེ ཀྱེ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་བ་འདེབས་པ། ལོག་པར་ལྟ་བ་སྟེ། དེ་དག་ལོག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ། ཤི་བའི་འོག་ཏུ་ངན་འགྲོ་ལོག་པར་ལྟུང་བའི་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བར་འགྱུར་རོ། ། སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་བ་མི་འདེབས་པ། ཡང་དག་པར་ལྟ་བ་སྟེ། དེ་དག་ཡང་དག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེའོ་ཞེས་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཇི་ལྟར་བསགས་པ་བཞིན་དུ་ཤེས་སོ། །དེ་ལྟར་མིག་རྣམ་པར་དག་པར་མི་ལས་འདས་པས། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཅི་ལྟར་བསགས་པ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: “Here, Śāriputra, the bodhisatva, with his mind composed, completely pure, completely cleansed, free from the vices, and free from the secondary vices, turns his mind toward the direct knowledge of the birth and death of sentient beings. With his perfectly pure, superhuman divine sight, he sees sentient beings dying and being born, as high born and low born, in states of good fortune and of misfortune, as inferior and superior. He knows the karma that sentient beings have accumulated and thinks, ‘Oh, how these sentient beings engage in bodily misconduct, verbal misconduct, and mental misconduct. They speak ill of the noble ones and hold wrong views. Because they act on the basis of these wrong views, when their bodies break down and they die, they will fall into a state of misfortune and be born in hell. Then there are those sentient beings who engage in good bodily conduct, good verbal conduct, and good mental conduct. They do not speak ill of the noble ones, and they hold right views. Because they act on the basis of these right views, when their bodies break down and they die, they will be born in a state of good fortune, in heaven.’ With his pure, superhuman divine sight, the bodhisatva knows how sentient beings are subject to the effects of their actions.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་མིག་སེམས་ཅན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་གཟུགས་སུ་སྣང་བ་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པ་སྟེ། གང་ཀླུ་ཐམས་ཅད་ཀྱི་ལྷའི་མིག་དང་། གནོད་སྦྱིན་ཐམས་ཅད་དང་། དྲི་ཟ་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་ཐམས་ཅད་དང་། སློབ་པ་ཐམས་ཅད་དང་། དགྲ་བཅོམ་པ་ཐམས་ཅད་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ལྷའི་མིག་དེ་བས་ལྷའི་མིག་གང་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པ། ཤིན་ཏུ་དམ་པ། ཤིན་ཏུ་རབ། ཤིན་ཏུ་བཟང་བ། ཤིན་གསལ་བ། འོད་གསལ་བ། ངེས་པར་འབྱུང་བའི་ལས་ཐམས་ཅད་ཀྱིས་ངེས་པར་བྱུང་བའི་ལྷའི་མིག་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་ན་རགས་པ་འམ། ཕྲ་བའམ། ངན་པའམ། བཟང་པོ་འམ། གང་རིང་བའམ། གང་ཉེ་བ་ཐམས་ཅད་སྣང་སྟེ དེའི་ལྷའི་མིག་གིས་ཤེས་སོ། ། ཤིན་ཏུ་རྟོགས་སོ། ། རབ་ཏུ་མཐོང་ངོ་། ། དེས་ལྷའི་མིག་དེས་གཟུགས་མེད་པ་ན་སྤྱོད་པ་མ་གཏོགས་པར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་ སེམས་ཅན་དག་འགྲོ་བ་ཐམས་ཅད་དུ་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། ། དེ་དག་གི་ལས་ཀྱི་རྒྱུ་ཡང་རབ་ཏུ་ཤེས་སོ། ། དེ་དག་གི་ལས་ཀྱི་འབྲས་བུ་ཡང་རབ་ཏུ་ཤེས་སོ། ། དེ་དག་གི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ། ། དབང་པོའི་རྒྱུ་ཡང་རབ་ཏུ་ཤེས་སོ། ། དབང་པོའི་རིམ་པ་ཡང་རབ་ཏུ་ཤེས་སོ། ། གང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཞིང་བཀོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མངོན་སུམ་དུ་མཐོང་བས་མཐོང་ངོ་། ། མཐོང་ནས་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་སྟེ། ། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པ་དེའི་བསྔོ་པ་འགྲུབ་པར་འགྱུར་རོ། ། དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པ་དེས་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་ངོ་། ། མཐོང་ནས་ ཀྱང་གང་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་ཆོ་ག་དང་། སྤྱོད་ཡུལ་དང་། སྤྱོད་པ་དང་། དྲན་པ་དང་། ཤེས་བཞིན་དང་། སྤྱོད་ལམ་གྱི་གནས་དང་། ཆོས་ཀྱི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ལ་གནས་པ་དང་། གཟུངས་ཐོབ་པའི་ཡེ་ཤེས་ལ་མཁས་པ་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། ཐབས་མཁས་པ་ལ་འཇུག་པ་དེ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “In this way, Śāriputra, the divine sight of the bodhisatva is superior to that of any sentient being. It sees forms and manifestations without obscuration. Compared to the divine sight of any nāga, any yakṣa, any gandharva, any asura, anyone aspiring to become an arhat, any arhat, or any pratyekabuddha, the divine sight of the bodhisatva is superior, greater, most excellent, exceptional. That divine sight has a greater range, its vision is clearer, and it can traverse all possible paths. With that divine sight, he knows which kinds of divine sight in the unlimited, infinite worlds in the ten directions are coarse or subtle, inferior or exceptional, far or near, and which enable one to see manifestations clearly. With this divine sight, he truly knows the death and birth of all those sentient beings in the unlimited, infinite worlds in the ten directions who have been reborn into any state of existence, with the exception of those in the formless realm. He knows their actions and the fruits of their actions. He knows their faculties. He knows the causes of their faculties. He knows the diversity of their faculties. With his clear vision, he sees all the wondrous arrays of buddha fields, the fields of the lords, that exist in the unlimited, infinite worlds in the ten directions. He dedicates this vision to the complete purification of their skandha of morality and causes the skandha of morality on which they are based to grow. With his perfectly pure, superhuman divine sight, he sees all the bodhisatva saṅghas of the buddhas, the lords. When he has seen them, he fully perfects all those honorable men’s tasks, activities, conduct, mindfulness, and awareness; their position on the noble path; the foundation for their understanding of the liberation of the Dharma; their skill in understanding how to obtain dhāraṇīs; and their penetration of wisdom, knowledge, and skillful means.

source: དེའི་མིག་དེ་ནི་གཟུགས་ཐམས་ཅད་མཐོང་བས་སྒྲིབ་པ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་གཟུགས་ཐམས་ཅད་ལ་མི་ཆགས་པས་ཆགས་པ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་བག་ལ་ཉལ་དང་། ལྟ་བ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བའོ། ། དེའི་མིག་དེ་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བས་རྣམ་པར་དག་པའོ། ། དེའི་མིག་དེ་ནི་ཡུལ་ཐམས་ཅད་ལ་མི་གནས་པའོ། ། དེའི་མིག་དེ་ནི་ཉོན་མོངས་པ་དང་། བག་ལ་ཉལ་རྣམས་མི་ལེན་པའོ། ། དེའི་མིག་དེ་ནི་ཐེ་ཚོམ་མེད་པས་རབ་རིབ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་སྒྲིབ་པ་མེད་པའི་ཆོས་རྣམས་ལ་ཀུན་ནས་ལྡང་བ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་ཆོས་སྣང་བ་རྣམས་ལ་ཆོས་སྣང་བ་ཐོབ་པའོ། ། དེའི་མིག་དེ་ནི་རྣམ་པར་ཤེས་པའི་སྤྱོད་པའི་ཡུལ་མ་ཡིན་ཏེ། ཡེ་ཤེས་ལ་རྟོན་པའོ། ། དེའི་མིག་དེ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་གོས་པ་མེད་པ། ཞེ་སྡང་མེད་པ། རྨོངས་པ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་འཕགས་པའི་རྣམ་པའི་དབང་པོ་རྣམས་ཀྱིས་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའོ། ། དེའི་མིག་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ། འོད་ཟེར་མཉམ་པར་གཏོང་བས་ཁོང་ཁྲོ་བ་མེད་པའི་མཚན་ཉིད་དོ། ། དེའི་མིག་དེ་ནི་སེམས་ཀྱི་འཁྲུག་པ་དང་བྲལ་བས་རྣམ་པར་དག་པའོ། ། དེའི་མིག་དེ་ནི་རང་བཞིན་གྱིས་འོད་གསལ་བས་དྲི་མ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་བསམ་པ་མི་འདོར་བས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་མངོན་པར་བསྒྲུབས་པའོ། ། དེའི་མིག་དེ་ནི་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བས། ཆགས་པ་མེད་པ། ཞེ་སྡང་མེད་པའོ། ། དེའི་མིག་དེ་ནི་དོན་དང་སྤྱོད་ཡུལ་དང་སྤྱོད་པ་དང་། སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོ་རླབས་པོ་ཆེར་གནས་པའོ། ། དེའི་མིག་དེ་ནི་སློང་བ་རྣམས་ལ་ཁོང་ཁྲོ་བ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་ཁོང་ཁྲོ་བ་མེད་པའོ། ། དེའི་མིག་དེ་ནི་གནོད་པར་སེམས་པ་རྣམས་ལ་རྗེས་སུ་བསྲུངས་པའོ། ། དེའི་མིག་དེ་ནི་ལེ་ལོ་ཅན་རྣམས་ལ་རབ་ཏུ་བཟུང་བ་སྟེར་བའོ། ། དེའི་མིག་དེ་ནི་སེམས་འཁྲུགས་པ་རྣམས་ལ་བསམ་གཏན་གྱི་ཡན་ལག་སྟོན་པའོ། ། དེའི་མིག་དེ་ནི་ཤེས་རབ་འཆལ་པ་རྣམས་ལ་ཤེས་རབ་ཀྱི་མིག་སྦྱིན་པའོ། ། དེའི་མིག་དེ་ནི་ལམ་ནོར་བར་ཞུགས་པ་རྣམས་ལ་ལམ་སྟོན་པའོ། ། དེའི་མིག་དེ་ནི་མོས་པ་ཆུང་བ་རྣམས་ལ་སངས་རྒྱས་རྒྱ་ཆེན་པོ་སྟོན་པའོ། ། དེའི་མིག་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྒྱ་ཆེན་པོས་མངོན་པར་འཕགས་པའི་མངོན་པར་ཤེས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མངོན་པར་གཞོལ་བ་སྟེ། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལྷའི་མིག་གི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: “His sight is unobscured, as it sees all forms. His sight is not fixed, as it is fixed on all forms. His sight is free from all inclinations and views. His sight is perfectly pure, as it is intrinsically clear. His sight is not reliant on any object. His sight is not subject to vices or tendencies. His sight is free of obscurations, as it is free from doubt. His sight is not overwhelmed in the midst of obstructions. His sight has attained vision among the manifestations of phenomena. His sight is reliant on knowledge and is not part of the sphere of consciousness. His sight is not fixed, not corrupted, and not bewildered by any of the vices. His sight is conducive to insight due to the features of the abilities of the noble ones. His sight is characterized by lack of aversion in that it is like rays of light shining equally on all sentient beings. His sight is perfectly pure, as it is free of the unwholesome. His sight is stainless, as it is intrinsically clear. His sight accomplishes Buddha sight, as he does not abandon his resolve. His sight is not obsessed and not malignant, as it is free of attachment and aversion. His sight is based on great compassion for sentient beings who act in the sphere of material objects. His sight is not hostile toward beggars. His sight does not scold those who are immoral. His sight takes care of those who are malicious. His sight inspires those who are lazy. His sight reveals the various aspects of meditation to those whose minds are agitated. His sight gives the sight of wisdom to those who lack wisdom. His sight reveals the path to those who are on the wrong path. His sight reveals the greatness of the Buddha to those whose liberation is inferior. His sight is the superior ability that has risen to the lofty heights of omniscient knowledge. It is oriented toward the essence of awakening. It is wholly devoted to the essence of awakening. This, Śāriputra, is the practice of the superior ability and knowledge of divine sight that the bodhisatva, the great being, fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ནི་གང་། མངོན་པར་ཤེས་པ་དང་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པ་ནི་གང་ཞེ་ན།
en: “What then, Śāriputra, is the superior ability and knowledge of the realization of divine hearing that bodhisatvas, great beings, possess? What is the practice of the superior ability and knowledge that they fully perfect?
